---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SiteMergeDisconnected
source: html/e3c2aff7-ff06-91fb-86fb-80a5b50c8442.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SiteMergeDisconnected Property

The two surfaces you are trying to merge are disconnected from one another. They should overlap, or at least share edges.

## Syntax (C#)
```csharp
public static FailureDefinitionId SiteMergeDisconnected { get; }
```